In [10]:
pip install sqlalche

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement sqlalche (from versions: none)
ERROR: No matching distribution found for sqlalche

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql postgresql://postgres:P%40%35%35w076@localhost:5432/cohort_4_

In [5]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
2 rows affected.

[('Ebejale Ikuenobe', 49, 'New York', 'Senior Data Engineer', 150000),
 ('Peter Madison', 55, 'New York', 'Senior Data Engineer', 100000)]

In [11]:
%%sql
INSERT INTO employee (employee_name, age, emp_location, job_role, salary)
VALUES ('Greg Johnson', 29, 'Ohio', 'Junior Developer', 60000)
;

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [12]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
3 rows affected.

[('Ebejale Ikuenobe', 49, 'New York', 'Senior Data Engineer', 150000),
 ('Peter Madison', 55, 'New York', 'Senior Data Engineer', 100000),
 ('Greg Johnson', 29, 'Ohio', 'Junior Developer', 60000)]

In [14]:
# Applying primary key to the table to create uniqueness
# Primary key is a column that uniquely identifies the records/rows in a table
# we have to create a column

In [25]:
%%sql

Drop TABLE employee;
CREATE TABLE employee (
    emp_id int PRIMARY KEY,
    first_name varchar(20),
    middle_name varchar(20),
    last_name varchar(20),
    employee_age int,
    emp_location varchar(20)
);

 * postgresql://postgres:***@localhost:5432/cohort_4_
Done.
Done.

[]

In [26]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
0 rows affected.

[]

In [27]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (1, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [28]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[(1, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York')]

In [30]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (2, 'Maxwell', 'Madison', 'Johnson', 40, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [31]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
2 rows affected.

[(1, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York'),
 (2, 'Maxwell', 'Madison', 'Johnson', 40, 'New York')]

In [35]:
%%sql

-- Table: public.employee

-- DROP TABLE IF EXISTS public.employee;

CREATE TABLE IF NOT EXISTS employee (
    emp_id int,
    first_name varchar(20),
    middle_name varchar(20),
    last_name varchar(20),
    employee_age int,
    emp_location varchar(20),
    PRIMARY KEY (emp_id)
);

 * postgresql://postgres:***@localhost:5432/cohort_4_
Done.

[]

In [36]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
0 rows affected.

[]

In [37]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (1, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [38]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (2, 'Maxwell', 'Madison', 'Johnson', 40, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [39]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
2 rows affected.

[(1, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York'),
 (2, 'Maxwell', 'Madison', 'Johnson', 40, 'New York')]

In [49]:
%%sql

Drop TABLE employee;

CREATE TABLE IF NOT EXISTS public.employee (
    emp_id int,
    first_name varchar(20),
    middle_name varchar(20),
    last_name varchar(20),
    employee_age int,
    emp_location varchar(20),
    PRIMARY KEY (first_name, last_name)
);

 * postgresql://postgres:***@localhost:5432/cohort_4_
Done.
Done.

[]

In [50]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
0 rows affected.

[]

In [51]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (3, 'Maxwell', 'kelly', 'Johnson', 40, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [52]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[(3, 'Maxwell', 'kelly', 'Johnson', 40, 'New York')]

In [54]:
%%sql
INSERT INTO employee (emp_id, first_name, middle_name, last_name, employee_age, emp_location)
VALUES (2, 'Maxwell', 'Madison', 'Fredlan', 40, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [66]:
# Is it possible to automatically fill in the primary key column automatically and incremmentally
# Using AUTO-INCREMENT ---- MySQL
# SERIAL in SQL

In [84]:
%%sql

-- Table: public.employee

DROP TABLE IF EXISTS public.employee;

CREATE TABLE IF NOT EXISTS public.employee (
    emp_id SERIAL,
    first_name varchar(20),
    middle_name varchar(20),
    last_name varchar(20),
    employee_age int,
    emp_location varchar(20),
    UNIQUE (emp_id)
);

 * postgresql://postgres:***@localhost:5432/cohort_4_
Done.

[]

In [85]:
%%sql
INSERT INTO employee (first_name, middle_name, last_name, employee_age, emp_location)
VALUES ('Maxwell', 'Madison', 'Fredlan', 40, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [86]:
%%sql
SELECT * FROM employee;

 * postgresql://postgres:***@localhost:5432/cohort_4_
8 rows affected.

[(1, 'Maxwell', 'Madison', 'Fredlan', 40, 'New York'),
 (2, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York'),
 (3, 'Timer', 'Clock', 'Hammer', 50, 'New York'),
 (4, 'James', 'Philip', 'Roller', 39, 'New York'),
 (5, 'Hui', 'Tom', 'Jack', 67, 'New York'),
 (6, 'Maxwell', 'Madison', 'Fredlan', 40, 'New York'),
 (7, 'Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York'),
 (8, 'Maxwell', 'Madison', 'Fredlan', 40, 'New York')]

In [73]:
%%sql
INSERT INTO employee (first_name, middle_name, last_name, employee_age, emp_location)
VALUES ('Ebejale', 'Kasimir', 'Ikuenobe', 49, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
1 rows affected.

[]

In [64]:
%%sql
INSERT INTO employee (first_name, middle_name, last_name, employee_age, emp_location)
VALUES ('Timer', 'Clock', 'Hammer', 50, 'New York'), 
        ('James', 'Philip', 'Roller', 39, 'New York'),
        ('Hui', 'Tom', 'Jack', 67, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
3 rows affected.

[]

In [68]:
# Using UNIQUE keys in a Table. UNIQUE KEYS identifies the items in the record of a column

In [99]:
%%sql

-- Table: public.employee2

-- Create the table if it doesn't exist
CREATE TABLE IF NOT EXISTS public.employee2 (
    emp_id SERIAL,
    first_name varchar(20),
    middle_name varchar(20),
    last_name varchar(20),
    employee_age int,
    emp_location varchar(20),
    UNIQUE (emp_id)
);

-- Truncate the table to remove all data
TRUNCATE TABLE public.employee2;

-- Reset the emp_id sequence
ALTER SEQUENCE public.employee2_emp_id_seq RESTART WITH 1;

 * postgresql://postgres:***@localhost:5432/cohort_4_
Done.
Done.
Done.

[]

In [100]:
%%sql
INSERT INTO employee2 (first_name, middle_name, last_name, employee_age, emp_location)
VALUES ('Timer', 'Clock', 'Hammer', 50, 'New York'), 
        ('James', 'Philip', 'Roller', 39, 'New York'),
        ('Hui', 'Tom', 'Jack', 67, 'New York');

 * postgresql://postgres:***@localhost:5432/cohort_4_
3 rows affected.

[]

In [101]:
%%sql
SELECT * FROM employee2;

 * postgresql://postgres:***@localhost:5432/cohort_4_
3 rows affected.

[(1, 'Timer', 'Clock', 'Hammer', 50, 'New York'),
 (2, 'James', 'Philip', 'Roller', 39, 'New York'),
 (3, 'Hui', 'Tom', 'Jack', 67, 'New York')]

In [114]:
import pandas as pd

gents = ['Godfrey', 'Fred', 'Courage', 'Roger']
ladies = ['Ebele', 'Miriam', 'Mariam', 'Kelechi']

i = 0

while i < len(gents) and i < len(ladies):
    group = [gents[i], ladies[i], gents[i+1] if i+1 < len(gents) else None, ladies[i+1] if i + 1 < len(ladies) else None]
    group = [name for name in group if name is not None]
    print(group)
    i += 2

['Godfrey', 'Ebele', 'Fred', 'Miriam']
['Courage', 'Mariam', 'Roger', 'Kelechi']